In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv("50_Startups.csv")

In [3]:
data.head()

,R&D Spend,Administration,Marketing Spend,State,Profit,Unnamed: 5
0,165349.20,136897.80,471784.10,New York,192261.83,NaN
1,162597.70,151377.59,443898.53,California,191792.06,NaN
2,153441.51,101145.55,407934.54,Florida,191050.39,NaN
3,144372.41,118671.85,383199.62,New York,182901.99,NaN
4,142107.34,91391.77,366168.42,Florida,166187.94,NaN

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   R&D Spend        50 non-null     float64
 1   Administration   50 non-null     float64
 2   Marketing Spend  50 non-null     float64
 3   State            50 non-null     object
 4   Profit           50 non-null     float64
 5   Unnamed: 5       1 non-null      float64
dtypes: float64(5), object(1)
memory usage: 2.5+ KB

In [5]:
data.corr()

,R&D Spend,Administration,Marketing Spend,Profit,Unnamed: 5
R&D Spend,1.000000,0.241955,0.724248,0.972900,NaN
Administration,0.241955,1.000000,-0.032154,0.200717,NaN
Marketing Spend,0.724248,-0.032154,1.000000,0.747766,NaN
Profit,0.972900,0.200717,0.747766,1.000000,NaN
Unnamed: 5,NaN,NaN,NaN,NaN,NaN

In [6]:
data.columns

Index(['R&D Spend', 'Administration', 'Marketing Spend', 'State', 'Profit',
       'Unnamed: 5'],
      dtype='object')

In [7]:
X = data[['R&D Spend', 'Administration', 'Marketing Spend']]

In [8]:
X.head()

   R&D Spend  Administration  Marketing Spend
0  165349.20       136897.80        471784.10
1  162597.70       151377.59        443898.53
2  153441.51       101145.55        407934.54
3  144372.41       118671.85        383199.62
4  142107.34        91391.77        366168.42

In [11]:
state = data['State']

In [12]:
state.head()

0      New York
1    California
2       Florida
3      New York
4       Florida
Name: State, dtype: object

In [13]:
state_dummy = pd.get_dummies(state)

In [14]:
state_dummy.head()

   California  Florida  New York
0           0        0         1
1           1        0         0
2           0        1         0
3           0        0         1
4           0        1         0

In [15]:
state_dummy.shape

(50, 3)

In [16]:
final_state = state_dummy.iloc[:,0:2]

In [17]:
final_state.head()

   California  Florida
0           0        0
1           1        0
2           0        1
3           0        0
4           0        1

In [19]:
X.head()

   R&D Spend  Administration  Marketing Spend
0  165349.20       136897.80        471784.10
1  162597.70       151377.59        443898.53
2  153441.51       101145.55        407934.54
3  144372.41       118671.85        383199.62
4  142107.34        91391.77        366168.42

In [20]:
X[['California', 'Florida']] = final_state

/home/sid/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:2963: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[k1] = value[k2]

In [22]:
X.head()

   R&D Spend  Administration  Marketing Spend  California  Florida
0  165349.20       136897.80        471784.10           0        0
1  162597.70       151377.59        443898.53           1        0
2  153441.51       101145.55        407934.54           0        1
3  144372.41       118671.85        383199.62           0        0
4  142107.34        91391.77        366168.42           0        1

In [23]:
y = data['Profit']

In [25]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [26]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [27]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20, random_state=42)

In [28]:
model = LinearRegression()

In [29]:
model.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [31]:
y_pred = model.predict(X_test)

In [43]:
y_pred

array([126362.87908254,  84608.45383635,  99677.49425148,  46357.46068582,
       128750.48288503,  50912.41741885, 109741.35032702, 100643.24281646,
        97599.27574595, 113097.42524433])

In [47]:
y_test.shape

(10,)

In [54]:
y_pred.shape

(10,)

In [57]:
from sklearn.metrics import confusion_matrix

In [ ]:
clf.scor